# CwpReuseLevelsSameName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpReuseLevelsSameName Property
ParameterTypeId Class See Also
---
"Reuse Levels with the same name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpReuseLevelsSameName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpReuseLevelsSameName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpReuseLevelsSameName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace